src/test/testtool/RaadpleegMetBurgerservicenummer/04/response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301" xmlns:gml="http://www.opengis.net/gml" xmlns:ns="http://www.egem.nl/StUF/sector/bg/0310" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<BG:stuurgegevens>
		<StUF:berichtcode>La01</StUF:berichtcode>
		<StUF:zender>
			<organisatie xmlns="http://www.egem.nl/StUF/StUF0301">NEDGR</organisatie>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">NEDMAG_VnA</applicatie>
		</StUF:zender>
		<StUF:ontvanger>
			<applicatie xmlns="http://www.egem.nl/StUF/StUF0301">GWS</applicatie>
			<gebruiker xmlns="http://www.egem.nl/StUF/StUF0301">PROD</gebruiker>
		</StUF:ontvanger>
		<StUF:tijdstipBericht>20241015055521156</StUF:tijdstipBericht>
		<StUF:crossRefnummer>1f5dcba5-80e4-4ab5-9dd6-a03db10699b1</StUF:crossRefnummer>
		<StUF:entiteittype>NPS</StUF:entiteittype>
	</BG:stuurgegevens>
	<BG:parameters>
		<StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
		<StUF:indicatorAfnemerIndicatie>false</StUF:indicatorAfnemerIndicatie>
		<StUF:aantalVoorkomens>1</StUF:aantalVoorkomens>
	</BG:parameters>
	<BG:antwoord>
		<BG:object StUF:entiteittype="NPS">
			<inp.bsn xmlns="http://www.egem.nl/StUF/sector/bg/0310">555555021</inp.bsn>
			<geslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">Verhuistest</geslachtsnaam>
			<voorvoegselGeslachtsnaam xmlns="http://www.egem.nl/StUF/sector/bg/0310">van den</voorvoegselGeslachtsnaam>
			<voornamen xmlns="http://www.egem.nl/StUF/sector/bg/0310">Kees</voornamen>
			<aanduidingNaamgebruik xmlns="http://www.egem.nl/StUF/sector/bg/0310">E</aanduidingNaamgebruik>
			<geslachtsaanduiding xmlns="http://www.egem.nl/StUF/sector/bg/0310">M</geslachtsaanduiding>
			<geboortedatum xmlns="http://www.egem.nl/StUF/sector/bg/0310">20020701</geboortedatum>
			<inp.geboorteplaats xmlns="http://www.egem.nl/StUF/sector/bg/0310">Hellevoetsluis</inp.geboorteplaats>
			<inp.geboorteLand xmlns="http://www.egem.nl/StUF/sector/bg/0310">6030</inp.geboorteLand>
			<overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.verblijftIn StUF:entiteittype="NPSTGO" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="TGO">
					<adresAanduidingGrp>
						<wpl.woonplaatsNaam>'s-Gravenhage</wpl.woonplaatsNaam>
						<gor.straatnaam>Burg Waldeckstraat</gor.straatnaam>
						<aoa.postcode>2552TS</aoa.postcode>
						<aoa.huisnummer>1</aoa.huisnummer>
						<aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend"/>
						<aoa.huisnummertoevoeging>BIS</aoa.huisnummertoevoeging>
					</adresAanduidingGrp>
				</gerelateerde>
			</inp.verblijftIn>
			<verblijfsadres xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<wpl.woonplaatsNaam>'s-Gravenhage</wpl.woonplaatsNaam>
				<gor.straatnaam>Burg Waldeckstraat</gor.straatnaam>
				<aoa.postcode>2552TS</aoa.postcode>
				<aoa.huisnummer>1</aoa.huisnummer>
				<aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend"/>
				<aoa.huisnummertoevoeging>BIS</aoa.huisnummertoevoeging>
				<begindatumVerblijf>20150808</begindatumVerblijf>
			</verblijfsadres>
			<inp.adresHerkomst xmlns="http://www.egem.nl/StUF/sector/bg/0310">W</inp.adresHerkomst>
			<sub.correspondentieAdres xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.burgerlijkeStaat xmlns="http://www.egem.nl/StUF/sector/bg/0310">1</inp.burgerlijkeStaat>
			<inp.gemeenteVanInschrijving xmlns="http://www.egem.nl/StUF/sector/bg/0310">0518</inp.gemeenteVanInschrijving>
			<inp.datumInschrijving xmlns="http://www.egem.nl/StUF/sector/bg/0310">20020702</inp.datumInschrijving>
			<vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<ing.datumVerkrijgingVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<ing.datumVerliesVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="nietGeautoriseerd" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.emigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend" xmlns="http://www.egem.nl/StUF/sector/bg/0310"/>
			<inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NAT">
					<code>0001</code>
				</gerelateerde>
			</inp.heeftAlsNationaliteit>
			<inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD" xmlns="http://www.egem.nl/StUF/sector/bg/0310">
				<gerelateerde StUF:entiteittype="NPS"/>
				<ouderAanduiding>Ouder1</ouderAanduiding>
			</inp.heeftAlsOuders>
		</BG:object>
	</BG:antwoord>
</BG:npsLa01></soapenv:Body></soapenv:Envelope>